{
	"jacob-levy": {
		"name": "Jacob Levy",
		"location": "Morris Plains, NJ",
		"bio": "Jacob Levy is a recent graduate of Muhlenberg College, where he double majored in Media & Communications and Film Studies. While Jacob loves watching numerous blockbusters such as <em>Avengers: Infinity War</em>, he is just as excited to watch foreign and independent films like <em>The Square</em>. Jacob enjoys writing for Gen Z Critics as it gives him a place to share his thoughts on overlooked films such as <em>Krisha</em>."
	},
	"jack-porter": {
		"name": "Jack Porter",
		"location": "Columbia, SC",
		"bio": "Jack Porter is a senior film major at Columbia College Chicago. He is currently finishing his undergraduate degree and will be pursuing a graduate degree in screenwriting in fall 2019. He has a love of cult cinema; the weirder the better. His love for storytelling is only matched by his love of film criticism. He is particularly interested in the prevalence of genre filmmaking in modern cinema." 
	},
	"tairyu-hirayama": {
		"name": "Tairyu Hirayama",
		"location": "Interlochen, MI",
		"bio": "Tairyu Hirayama was born and raised in Tokyo, Japan. He is currently studying Motion Picture Arts in his third year at Interlochen Arts Academy to pursue a career in film. His multicultural upbringing has led him to be keen on the many subtle and complex components that affect interpretation of happiness and suffering. His mind is filled with stories inspired from his experiences and observations of emotional and mental attentiveness from all unique perspectives. His most recent film, <em>Amanda</em>, was nominated for the International Award and Best Original Score at the All American High School Film Festival."
	},
	"rita-zhang": {
		"name": "Rita Zhang",
		"location": "New York, NY",
		"bio": "Rita Zhang received her Bachelor&rsquo;s degree in Columbia University&rsquo;s Film and Media Studies. Her 12 years of acting experience in movies rooted her ceaseless love in film. Her wide spectrum of all-time favorites range from Richard Linklater&rsquo;s <em>Everybody Wants Some!!</em> to Luis Bu&ntilde;uel&rsquo;s <em>Diary of a Chambermaid</em>. She believes that writing film reviews enables her to capture and sustain many levels of emotions in the film world. She is at her happiest when learning that her film review moves and inspires the readers."
	},
	"raphael-rosalen": {
		"name": "Raphael Rosalen",
		"location": "Los Angeles, CA",
		"bio": "Raphael Rosalen is a Cinema and Media Studies undergraduate student at the University of Southern California&rsquo;s School of Cinematic Arts, where he also serves as the president of the Undergraduate Student Council, and a multimedia artist. Interested in celebrity and popular culture and feminism theory, Raphael recently won an award for a research paper on gender equality in Hollywood in 2016. Raphael is also interested in technology and how it can augment audiovisual content. He is currently working towards becoming a cinema and media scholar, creating a visual EP emphasizing new technology in music and filmmaking, and writing for a new media critique project. Some of his favorite movies are <em>Sunset Boulevard</em>, <em>Blue Jasmine</em>, and <em>The Bling Ring</em>."
	},
	"paul-kim": {
		"name": "Paul Kim",
		"location": "New York, NY",
		"bio": "Paul Kim is a journalist, occasional comedian, and full-time film nerd. A freshman Journalism and Cinema Studies major at NYU, he hopes to dive into the film review scene in New York. When he&rsquo;s not trying to decide whether refillable popcorn buckets in cinemas are a rip-off or not, Paul enjoys driving through his hometown of Atlanta, walking the streets of New York, and trying to &ldquo;accidentally&rdquo; become an extra in a feature film. When he&rsquo;s feeling all &ldquo;journalisty&rdquo; and pretentious, his favorite film is <em>Spotlight</em>. However, he swears by <em>The Nice Guys</em>, and that new <em>Jumanji</em> movie with The Rock and Jack Black." 
	},
	"nicholas-beland": {
		"name": "Nicholas Beland",
		"location": "Seattle, WA",
		"bio": "Nico Beland is a 23-year-old film enthusiast and reviewer who is heavily influenced by critics such as Gene Siskel and Roger Ebert, as well as Nostalgia Critic and Angry Video Game Nerd. He frequently reviews movies on his blog, Moviewatchin&rsquo; Psychopath, which he has been writing since 2013. Beland recently gained attention from Angry Video Game Nerd&rsquo;s creator James Rolfe after reviewing <em>Angry Video Game Nerd: The Movie</em>. He also attends conventions such as Seattle&rsquo;s Emerald City ComiCon, Sakura Con, Portland&rsquo;s Rose City Comic Con, and Retro Gaming Expo. Nico Beland is extremely passionate and creative, and he is always cracking jokes in everything he does."
	},
	"nathan-ginter": {
		"name": "Nathan Ginter",
		"location": "Interlochen, MI",
		"bio": "Nathan has been passionate about films since the age of five and is pursuing a career in filmmaking. He has always been drawn to the idea of creating his own world and is constantly pushing himself and following his curiosities to do just that. To him, writing, photography, illustration, and music are just an extension of that passion. Currently, he is a senior in high school in the Motion Picture Arts program at Interlochen Academy and was honored to have recently been named a 2018 National YoungArts Finalist & Presidential Scholar Nominee."
	},
	"michael-culbertson": {
		"name": "Michael Culbertson",
		"location": "Winston-Salem, SC",
		"bio": "Michael Culbertson graduated from University of North Carolina (UNC) Greensboro with a Bachelor&rsquo;s in Psychology, and is currently attending UNC School of the Arts for his Master&rsquo;s in Screenwriting. While the degrees seem to be unrelated, he feels his psychology background helps him better understand the characters in his writing, as well as elements that an audience member may find captivating and emotional. He believes film criticism is essential for helping aspiring and prominent filmmakers improve their craft, and takes inspiration for reviewing from viral YouTube reviewers Chris Stuckman and Jeremy Jahns. His current favorite films are <em>The Incredibles</em>, <em>Get Out</em>, and <em>The Wolf of Wall Street</em>." 
	},
	"lindsy-m.-bissonnette": {
		"name": "Lindsy M. Bissonnette",
		"location": "New York, NY",
		"bio": "Lindsy M. Bissonnette is a freelance director and writer in NYC who loves improv. She recently received her MFA in Performing Arts and has a BFA in Acting and Directing and a BA in Communications. Lindsy is a media associate for FF2 Media where she reviews films, interviews writers and directors and writes articles. She also currently works for artistic directors at Off-Broadway theatres in Manhattan. She enjoys sketch and comedy writing, loves film, and is excited to be a part of Gen Z Critics."
	},
	"levi-feil": {
		"name": "Levi Feil",
		"location": "Wichita, KA",
		"bio": "Levi Feil is a 16-year old who has been making films since he was 8. Levi&rsquo;s first inspiration was the director Larry Blamire, who made spoof movies of classic genres like the horror film. Levi&rsquo;s grandpa gave him his first camera one Christmas, and he started making films with his little brother. Since then, Levi has entered and won different local film competitions and has been doing freelance video work for local businesses."
	},
	"lane-mckenna": {
		"name": "Lane McKenna",
		"location": "Interlochen, MI",
		"bio": "Lane McKenna is writer, filmmaker, and artist. She is currently a senior at Interlochen Arts Academy in Interlochen, Michigan. She is originally from Long Island, New York. She plans to study Philosophy and Film in college. She recently directed a short film, <em>Grab Him</em> by <em>the-</em> and would like to continue making films for a social change. Lane has always been a film enthusiast and is excited about the creating new work."
	},
	"katelyn-tsai": {
		"name": "Katie Tsai",
		"location": "Andover, MA",
		"bio": "Katelyn &ldquo;Katie&rdquo; Tsai is a junior at the Winsor School in Boston. Her interest in cinematography developed when she took two film courses at Phillips Academy Summer Session in Andover, MA. As part of these courses, she created short films and acted in her classmates&rsquo; films as well. In addition to filmmaking, Katie has a passion for dance, theater, literature, and photography. She dances in and out of school and has performed in several shows and recitals. She has also acted in various school plays. Katie&rsquo;s love of visual and performing arts inspired her to become a Gen Z Critic. While she is intrigued by a movie&rsquo;s plot, she especially loves its artistic and aesthetically pleasing shots. Katie is glad that Gen Z Critics is a forum where young people can share their love of movies with others."
	},
	"james-mackenzie": {
		"name": "James Mackenzie",
		"location": "Rye, NY",
		"bio": "James Mackenzie is a recent graduate of the University of Chicago, where he studied English Literature and Cinema Studies. While there, he was the Arts Editor of the Chicago Maroon student newspaper, where he also published numerous critical pieces on film and television. He wrote his senior thesis on the aesthetics of contemporary Japanese horror cinema. Some of his favorite contemporary filmmakers include Kiyoshi Kurosawa, Kelly Reichardt, and Paul Thomas Anderson. Currently lurking on Film Twitter and bouncing between odd jobs somewhere in New York."
	},
	"eve-elizondo": {
		"name": "Eve Elizondo",
		"location": "Westwood, MA",
		"bio": "Eve Elizondo is a writer, photographer, and athlete. She is currently a senior at the Winsor School in Boston, and she plans to study English, photography, and film in college. She created a short film in her freshman year that won gold in a regional contest, but her focus shifted to photography soon after. However, Eve has always been a film enthusiast and she hopes to return to her roots in the years to come. She is particularly interested in screenwriting and the art of trailers. Her favorite films from 2016 are <em>Hell or High Water</em> and <em>Arrival</em>."
	},
	"elizabeth-kim": {
		"name": "Elizabeth Kim",
		"location": "San Jose, CA",
		"bio": "A freshman at Stanford University, Elizabeth &ldquo;Betsy&rdquo; Kim interned at the <a href=\"https://www.festival-cannes.com/en/\" target=\"_blank\">Cannes International Film Festival</a> in 2018. Her favorite movies of 2018 are <em>Annihilation</em> and <em>Widows</em>."
	},
	"davey-huang": {
		"name": "Davey Huang",
		"location": "Interlochen, MI",
		"bio": "Originally from Taipei, Taiwan, Davey Huang is a Motion Picture Arts major studying at Interlochen Arts Academy in Interlochen, Michigan. He started becoming interested in filmmaking since the age of six, and started my pursue of the craft of filmmaking since the summer of 2014. Huang&rsquo;s favorite film is Federico Fellini&rsquo;s <em>8 1/2</em>. He is most interested in the aspects of directing, editing, cinematography, sound mixing and visual effects, and has been on multiple sets during the study at Interlochen."
	},
	"ben-wasserman": {
		"name": "Ben Wasserman",
		"location": "Worcester, MA",
		"bio": "Ben Wasserman is a twenty-one year old aspiring film critic. A senior at Clark University majoring in Screen Studies, Ben&rsquo;s love for the technical aspect of cinema emerged during mid-high school, during which he took numerous courses in television production. This passion has since been incorporated into his college courses and internships at <a href=\"https://comicsverse.com/\" target=\"blank\">ComicsVerse</a> and <a href=\"https://www.mxdwn.com/\" target=\"blank\">Mxdwn</a>, in which he reviews and analyzes newly released films and entries in the comic book medium. Amongst his favorite films are <em>Raiders of the Lost Ark</em>, <em>The Dark Knight</em>, <em>2001: A Space Odyssey</em>, and <em>Collateral</em>."
	},
	"anthony-reyes": {
		"name": "Anthony Reyes",
		"location": "New York, NY",
		"bio": "Anthony Reyes is a recent college graduate from CUNY Hunter College and lives in New York as a freelance Production Associate. Currently he is working for <a href=\"http://rumur.com/\" target=\"blank\">Rumur Inc.</a>, a Brooklyn-based production studio behind many award-winning documentaries such as <em>Battle for Brooklyn</em> and <em>Who Took Johnny?</em>, the latter of which can be found on Netflix. With one short film under his belt and many ideas for future projects, Anthony hopes to create more content and write for television in the future. Film criticism allows him to explore how a specific film makes him feel a certain way, and how he can use it to develop his own craft as a storyteller. Some of his favorite films include Richard Linklater&rsquo;s <em>Before</em> trilogy, Robert De Niro&rsquo;s <em>A Bronx Tale</em>, Paul Thomas Anderson&rsquo;s <em>Punch-Drunk Love</em>, and Spike Jonze&rsquo;s <em>Her</em>."
	},
	"anthony-d’eredita": {
		"name": "Anthony D&rsquo;Eredita",
		"location": "Interlochen, MI",
		"bio": "Anthony D&rsquo;Eredita lives in Vienna, Virginia, but only when he&rsquo;s not studying film at boarding school. His love of film roots back to his childhood when he would make movies upon movies with his brother that they would shoot on his iPad. He took this love of film to Interlochen Arts Academy where he currently studies film as a senior. Some of his favorite movies are <em>City of God</em>, <em>Boogie Nights</em> and <em>Good Time</em>. Recently he is doing more graphic design work and he plans to attend college for design, incorporating it into the films he creates."
	},
	"alexander-leiss": {
		"name": "Alexander Leiss",
		"location": "New York, NY",
		"bio": "Alexander Leiss is a filmmaker who has worked on over two dozen film sets in various roles, written five produced short films, and produced three documentaries, which he both filmed and edited. His films have screened at festivals in New York and California and have garnered awards for Best Screenplay and Best Picture. Alexander is currently working on a draft of his latest feature length screenplay and interning with a New York based production company." 
	},
	"ada-grey": {
		"name": "Ada Grey",
		"location": "Chicago, IL",
		"bio": "Ada has been reviewing plays, and sometimes movies, since she was 4 years old at her blog <a href=\"http://adagrey.blogspot.com/\" target=\"blank\">Ada Grey Reviews for You</a>. She is now 12 and also enjoys acting on stage and screen. She has appeared on episodes of <em>Sirens and Chicago Fire</em>, in the web series <em>Funny.</em>, <em>Jacketman</em>, and <em>Under Covers</em>, and in many plays in Chicago.  She has had the pleasure of interviewing some really great people like the voice actors from <em>The Good Dinosaur</em>, as well as Michael Urie, Ana Villafa&ntilde;e, Josh Segarra, and Dee Snider."
	},
	"rose-lehrman": {
		"name": "Rose Lehrman",
		"location": "Hudson, NY",
		"bio": "Rose is currently a sophomore at Interlochen Arts Academy studying Motion Picture Arts. She is from the Upper Hudson Valley, where her interest in film was piqued by a local film festival when she was in the fifth grade, and she has been talking about and writing about films ever since."
	},
	"jacob-boblitt": {
		"name": "Jacob Boblitt",
		"location": "New York, NY",
		"bio": "I originally hail from Warwick, Rhode Island where I was raised by two parents and two dogs. Throughout high school I made short films with my friends which got me hooked on the process. I aspire to write for a TV show and to hike the Appalachian Trail. I am currently a freshman attending New York University Tisch School of the Arts for film and television."
	},
	"jennifer-woo": {
		"name": "Jennifer Woo",
		"location": "Brooklyn, NY",
		"bio": "I am a Motion Picture Artist in the 11th grade at Interlochen Arts Academy. I went to Fiorello H. LaGuardia High School for my first two years of high school but recently transferred. I grew up in Brooklyn, NY, with my dad. I love all types of art, but filmmaking and writing are my two main focuses at the moment."
	},
	"maya-shah": {
		"name": "Maya Shah",
		"location": "Baltimore, MD",
		"bio": "Maya Shah was born in 2003, and is an aspiring filmmaker. Art has always been a huge part of her life. She is a multi-faceted artist with interests in piano, dance, creative writing, and filmmaking. However, filmmaking is what she wants to focus on seriously for the rest of her life. She began making films in sixth grade, and continued all through middle school. By the end of middle school, she knew she wanted to make films for the rest of her life. She wants to focus on directing and editing specifically in the field of film, and currently attends Interlochen Arts Academy, where she is majoring in the Motion Picture Arts Program. Here, she is receiving excellent hands-on experiences with state of the art equipment, and is also building her portfolio and artist statement for college."
	},
	"abby-ann-muller": {
		"name": "Abby Ann Muller",
		"location": "Rogers City, MI",
		"bio": "I enjoy all things involving movies, music and food. I was in track, cross country, softball, dancing, karate and pageants. I mostly spend my free time on Netflix or listening to music. I really enjoy going to concerts and hanging out with my puppy Reese. Once I graduate, I would like to go into special effects makeup and photography. My dream job is being a photographer in New York."
	},
	"kiara-linver": {
		"name": "kiara-linver",
		"location": "Interlochen, MI",
		"bio": "From the age of four I started musical theatre, and did a bit of acting for fun until 5th grade, when I decided to write, shoot, and edit a musical movie (albeit it was not very good due to the fact that I was in 5th grade) but I fell in love with the filmmaking world. I took a film class at my junior high school, attended the Multimedia Arts and Design Academy for my 9th-11th grade years, and applied and was accepted to Interlochen Arts Academy for the Motion Picture Arts major for my senior year. I am so excited to see what change I can make by sparking creativity, entertainment, and love into the world!"
	},
	"kelly-forzaglia": {
		"name": "Kelly Forzaglia",
		"location": "Fuquay-Varina, NC",
		"bio": "Kelly Forzaglia is in her first year at UNC School of the Arts, pursuing Screenwriting. While writing is her first passion, her favorite place is the movie theater; she goes there at least once a week. She loves universal films and mainly focuses on character development. Some of her favorite movies range from classics like <em>The Godfather</em> and <em>Gone With the Wind</em> to more modern films like <em>The Secret Life of Walter Mitty</em>, <em>La La Land</em>, and <em>Iron Man</em>."
	},
	"kaki-thorell": {
		"name": "Kaki Thorell",
		"location": "Greenville, NC",
		"bio": "I&rsquo;m an 18-year-old college freshman with a name that people find difficult to pronounce and believe. All my life I have loved 2 things: making people listen to my loud opinions and movies. So naturally, film criticism felt like the right place for me. I&rsquo;m a diehard <em>Jennifer&rsquo;s Body</em> fan, <em>Star Wars</em> prequel defender, collector of DVDs, Keira Knightley enthusiast, and a nostalgic sap who still misses her local video store."
	},
	"domenic-strazzabosco": {
		"name": "Domenic Strazzabosco",
		"location": "San Francisco, CA",
		"bio": "Domenic Strazzabosco is completing his third year at San Francisco State University where he is studying cinema and journalism. He is interested in both film criticism and in pop culture, the roles both Hollywood and actors play in society, and he hopes to be able to cover these topics at a publication in the future. Additionally he enjoys analyzing the portrayals of female characters and thinking of films through a feminist or intersectional perspective. Amongst his favorite films are <em>Sunset Blvd.</em>, <em>The Incredibles</em>, <em>Boyhood</em> and <em>The Normal Heart</em> but strongly believes the best piece of entertainment produced is <em>Game of Thrones</em>."
	},
	"": {
		"name": "",
		"location": "",
		"bio": ""
	},
	"ryan-parker": {
		"name": "Ryan Parker",
		"location": "Washington, D.C.",
		"bio": "My name is Ryan Parker. I was born in New London, Connecticut, and was raised in Hingham, Massachusetts. I first gained interest in film after watching Alfonso Cuarón&rsquo;s <em>Children of Men</em> (2006) in a high school literature class. This led me to attending American University in Washington, D.C., where I study film production. At AU, I have broadened my library of film, ranging from Independent Genre Cinema to International Arthouse. Since attending college, I have written for several student-run film criticism publications, including <a href=\"https://lacemagx.com/reviews/\" target=\"_blank\">LACE Magazine</a> and <a href=\"https://medium.com/b-roll\" target=\"_blank\">B-Roll</a>, where I share my love and appreciation of film to a larger audience. Some of my favorite films include <em>The Witch</em> (2015), <em>Come and See</em> (1985), and <em>In the Mood for Love</em> (2000)."
	},
	"mang-lu": {
		"name": "Mark Lu",
		"location": "Washington, D.C.",
		"bio": "Mang, who goes by Mark, is an undergraduate student in the American University Class of 2021 and studies economics and political science. He is from the Bay Area in California and is an admin for an online film community on Facebook. He is an amateur screenwriter and co-produced his first feature-length production last year, which wrapped principal photography at the end of 2018 and is set for a May 2019 release. His favorite movie is <em>The Lion King</em>."
	},
	"anthony-iessi": {
		"name": "Anthony Iessi",
		"location": "New Rochelle, NY",
		"bio": "I am a recent graduate of Syracuse University where I majored in film. Currently, I work as a customer service assistant at Film Emporium, a film insurance brokerage in Larchmont, NY.  Since I was very little, I&rsquo;ve been passionate about writing and talking about films. While I enjoy seeing film&rsquo;s online and instantaneously, I still don&rsquo;t mind seeing films in a theater. My favorite filmmakers to watch are Martin Scorsese and Paul Thomas Anderson."
	},
	"haidyn-harvey": {
		"name": "Haidyn Harvey",
		"location": "Calabasas, CA",
		"bio": "I&rsquo;m a senior at Pepperdine University studying film and journalism. I am the assistant editor for the Life & Arts section of my campus newspaper where I regularly write film reviews. I&rsquo;ve been passionate about film as long as I can remember and have traveled the world pursuing my passion. In 2016 I interned at the Cannes Film Festival where I had the opportunity to watch a lot of incredible and groundbreaking movies. In my free time, I also love to hike and I love poetry."
	},
	"jacob-gratto": {
		"name": "Jacob Gratto",
		"location": "Chagrin Falls, OH",
		"bio": "Jacob is a junior film major at Syracuse University. Amidst pursuing his B.F.A., writing film reviews is a hobby that he is most passionate about. It is ultimately Jacob&rsquo;s dream to one day write and direct his own feature film. Jacob believes writing about film is both difficult yet rewarding: writing about cinema is meditating, but on the other hand, film is a visual medium, so how many words can speak for the power of the screen? Some of Jacob&rsquo;s favorite films include: <em>Pulp Fiction</em>, <em>The Godfather</em>, <em>Taxi Driver</em>, <em>Eyes Wide Shut</em>, <em>Star Wars</em> (1977), <em>Pickpocket</em>, <em>Au Hasard Balthazar</em>, <em>Tampopo</em>, <em>Dazed and Confused</em>, <em>Spirited Away</em>, and <em>Slacker</em>&mdash;a healthy mix of mainstream, foreign, and independent cinema."
	},
	"elizabeth-gilmore": {
		"name": "Elizabeth Gilmore",
		"location": "Washington, D.C.",
		"bio": "Elizabeth Gilmore is senior at American University. She is currently finishing her undergraduate degree in Audio Technology with a concentration in Physics. She also chose to study cinema studies as a minor in order to keep herself educated on the realm of film. Recently, she has taken a particular interest in A24&rsquo;s movies and hopes to one day combine her interests for sound and film."
	},
	"tara-dorje": {
		"name": "Tara Dorje",
		"location": "Ann Arbor, MI",
		"bio": "Tara Dorje is a junior studying Art History at the University of Michigan. Originally from Ann Arbor, Michigan, Tara is currently interning at The Metropolitan Museum of Art and MoMA PS1 in New York City. She is passionate about studying visual culture and wearing ugly band t-shirts."
	}
}